# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [2]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names = pd.read_csv('US_Baby_Names_right.csv')
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 4. See the first 10 entries

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [5]:
baby_names.drop(['Id','Unnamed: 0'],inplace=True,axis=1)
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [7]:
print('Male') if baby_names.Gender.value_counts()['M'] > baby_names.Gender.value_counts()['F']  else print('Female')

Female

### Step 7. Group the dataset by name and assign to names

In [8]:
names = baby_names.groupby('Name')

### Step 8. How many different names exist in the dataset?

In [13]:
baby_names['Name'].nunique()

17632

### Step 9. What is the name with most occurrences?

In [14]:
baby_names['Name'].mode()

0    Riley
Name: Name, dtype: object

### Step 10. How many different names have the least occurrences?

In [19]:
min = baby_names['Name'].value_counts().min()
(min == baby_names['Name'].value_counts()).sum()

3682

### Step 11. What is the median name occurrence?

In [20]:
baby_names['Name'].value_counts().median()

8.0

### Step 12. What is the standard deviation of names?

In [21]:
baby_names['Name'].value_counts().std()

122.0299635081389

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [25]:
baby_names['Name'].value_counts().describe()

count    17632.000000
mean        57.644907
std        122.029964
min          1.000000
25%          2.000000
50%          8.000000
75%         39.000000
max       1112.000000
Name: count, dtype: float64